---
kind: other
id: Properties.T:Autodesk.Revit.DB.SlabEdge
source: html/47c858fb-3753-260b-e5fe-965ad7059429.htm
---
# SlabEdge Properties

Retrieve/set the angle of the hosted sweep object relative its references (Unit : Radian).